trade_exp/src/Documents/АвансовыйОтчет/АвансовыйОтчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="9de71b46-e9bf-4b0b-8f3c-4abcd6a385dd">
  <name>АвансовыйОтчет</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.РасходыПоОбъектам</registerRecords>
  <attributes extendedConfigurationObject="0f4f31e6-e5d4-4349-9ab2-3e03274f7b17">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6bc9852d-6374-44e3-adcd-4d3edae8da97">
    <name>КоличествоДокументов</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>5</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="e4f9b07f-478a-471e-924d-053dfc8f4e44">
    <name>СуммаОтклонено</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="fce3fc63-bb19-47dd-9246-49c1012c2ea4">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="cea53d2f-d20c-42b1-b64e-75157d7f5879">
    <name>ПодотчетноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6b203df1-bef0-4611-abc3-e7e7ad316dcc">
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4847defa-b118-49f1-99af-8690ecf1de4f">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c171bb79-95ad-402f-af65-0c318b816f55">
    <name>ЗакупкаПодДеятельность</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e6a97154-22ec-4435-b837-6111ad419c5e">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6638ac0e-be16-4f59-8698-b83ea6d8e8b1">
    <name>ГлавныйБухгалтер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1ae44753-0b9a-4c13-8f5e-e026a7b601d7">
    <name>НазначениеАванса</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="10473ac7-2400-4279-b9be-3f15a8ab87bc">
    <name>КоличествоЛистов</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>5</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a5529369-96c4-44c4-aecb-4374327b0b14">
    <name>Руководитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9ea80429-d00a-4788-a5da-de0157be1d80">
    <name>БанковскийСчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="fdaf9361-258c-403d-8875-42b26b4cf6e5">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="a6e2d8f7-0f1d-47c8-8396-c51464740b97">
    <name>ПрочиеРасходы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="e517e4fe-27c7-48b9-99fc-5108d11217cf">
      <name>СтатьяРасходовБУ</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="2997c643-9686-45fb-8819-0d056887ffeb">
      <name>АналитикаАктивовПассивов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b31ed6ed-a005-43f5-8c44-3f59a82caeba">
      <name>НаправлениеДеятельности</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="1f3195ed-4a13-4c7b-b94d-8037360be86a">
      <name>НомерВходящегоДокумента</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="4a4920ac-58e9-4b5e-903f-16370f7a650d">
      <name>СтатьяРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="d36ce471-1e27-4e3f-a925-fcd33f357e24">
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="c6faf23a-3403-4a55-bb53-c3ec42ab6e6b">
      <name>НаименованиеВходящегоДокумента</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>128</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="787f603a-861a-41ba-ad45-b303a23bbc83">
      <name>Содержание</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>1000</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="eb577954-0a86-484b-bcd8-38a0fd5915fd">
      <name>Валюта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="aa8ecf14-7914-4258-8670-3451b447f6ce">
      <name>СуммаСНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="4f6a6e32-a90e-4ae5-9a8a-ae4047c039f7">
      <name>ДатаВходящегоДокумента</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="714cd7bc-ec76-4e3d-9356-9d75e7a2d618">
      <name>СтатьяДвиженияДенежныхСредств</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="f59d6215-187c-4e74-b828-1ab307ae3532">
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="2243899d-61da-486d-8fb3-729b87a24b54">
      <name>Контрагент</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="bbc6fca0-03cc-447b-8242-a95c7a5f6553">
      <name>Подразделение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="64fe7312-926c-4537-b307-0acc79991954">
      <name>АналитикаРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="eb34e28e-7383-4ec8-a1cb-3694dbed2853">
      <name>Отменено</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="c26ce8a5-928f-47b9-a59c-2860ed71d1e8">
      <name>ПричинаОтмены</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>255</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="98cd8316-966c-42bd-baa6-e86aea3d86cd">
      <name>ОбъектРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="e032fafc-3d1c-4652-9f6b-f96505f34f08">
      <name>АналитикаОбъекта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="c88d49ac-57e5-40b7-b164-8cbf36b59d30">
    <name>ОплатаПоставщикам</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="23675a72-cfd0-4e13-971c-56e1f0c4434c">
      <name>Поставщик</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="cf2dbcf2-04af-4373-831e-c104175e6c56">
      <name>ДатаВходящегоДокумента</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="ac1a2efc-f75b-4169-b1a6-fb5b2d5016c3">
      <name>Контрагент</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="9e0ad1d5-f77d-4e24-998c-f67eb5a01030">
      <name>СуммаВзаиморасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="045cf292-f00e-4e8e-a6d2-d642ebc37e06">
      <name>СтатьяДвиженияДенежныхСредств</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="3bd0b365-9277-47f0-92d0-33ffd0f178ec">
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="27e247e5-8fee-4ad2-891a-e7abbe9bdc75">
      <name>Валюта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="72650a99-6a5b-43ee-8820-35a6407a6dd8">
      <name>НомерВходящегоДокумента</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="67b3a888-3ca3-4281-9818-435d34229402">
      <name>ВалютаВзаиморасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="e1dcbcc5-febe-433e-9ec5-846511eaba17">
      <name>Комментарий</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="b6d8cadb-fa62-4526-97f1-3ea3013fd8f8">
    <name>КонвертацияВалюты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="05f4f263-5e94-4216-a6a0-af3f3322892e">
      <name>КурсКонвертации</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>4</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="dfca2163-bb17-48c3-a2c9-28388379349a">
      <name>ВалютаКонвертации</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="f4972a7a-2829-4960-bef0-7617a52d827f">
      <name>СтатьяДвиженияДенежныхСредств</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="03f92d32-b524-42a1-8bdd-bde62c63c2d7">
      <name>СуммаКонвертации</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="1367f244-da3c-41ac-aac2-a03ccead7eec">
      <name>Валюта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="05916418-2931-4895-8ce5-a54ca070733c">
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/Documents/АвансовыйОтчет/Forms/ФормаДокумента/Module.bsl
#Область СтатьяРасходовБУ

&НаКлиенте
Процедура Док_ТоварыСтатьяРасходовБУНачалоВыбораПосле(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИдентификаторСтроки", Элементы.ПрочиеРасходы.ТекущаяСтрока);
	ОписаниеОповещения = Новый ОписаниеОповещения("СтатьяРасходовБУВыборЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Статья", Элементы.ПрочиеРасходы.ТекущиеДанные.СтатьяРасходовБУ);
	ПараметрыФормы.Вставить("ПараметрыВыбора", Элемент.ПараметрыВыбора);
	
	ОткрытьФорму("ОбщаяФорма.ФормаВыбораСтатьи", ПараметрыФормы, ЭтаФорма, , , , ОписаниеОповещения);

КонецПроцедуры

&НаКлиенте
Процедура СтатьяРасходовБУВыборЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Строка = Объект.ПрочиеРасходы.НайтиПоИдентификатору(ДополнительныеПараметры.ИдентификаторСтроки);
	Строка.СтатьяРасходовБУ = Результат; 
	
КонецПроцедуры

&НаКлиенте
Процедура Док_ПрочиеРасходыСтатьяРасходовПриИзмененииПосле(Элемент)
	
	СтрокаТаблицы = Элементы.ПрочиеРасходы.ТекущиеДанные;
	Если Не значениезаполнено(СтрокаТаблицы.СтатьяРасходовБУ) Тогда
		СтрокаТаблицы.СтатьяРасходовБУ=СтрокаТаблицы.СтатьяРасходов;
	КонецЕсли;	
	
КонецПроцедуры 

&НаКлиенте
Процедура Док__ЗаполнитьСтатьюРасходовБУПосле(Команда)
	
	ВыделенныеСтроки = Элементы.ПрочиеРасходы.ВыделенныеСтроки;
	
	Если Объект.ПрочиеРасходы.Количество() = 0 Тогда
		ПоказатьПредупреждение( , НСтр("ru = 'В список ""Расходы"" не введено ни одной строки.'"));
		Возврат;
	ИначеЕсли ВыделенныеСтроки.Количество() = 0 Тогда
		ПоказатьПредупреждение( , НСтр("ru = 'В списке ""Расходы"" не выделено ни одной строки.'"));
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("СтатьяРасходовБУВыборДляЗаполненияЗавершение", ЭтотОбъект);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Статья", Элементы.ПрочиеРасходы.ТекущиеДанные.СтатьяРасходовБУ);
	ПараметрыФормы.Вставить("ПараметрыВыбора", Элементы.ПрочиеРасходыСтатьяРасходовБУ.ПараметрыВыбора);
	
	ОткрытьФорму("ОбщаяФорма.ФормаВыбораСтатьи", ПараметрыФормы, ЭтаФорма,,,, ОписаниеОповещения);

КонецПроцедуры

&НаКлиенте
Процедура СтатьяРасходовБУВыборДляЗаполненияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыделенныеСтроки = ОбщегоНазначенияКлиентСервер.СкопироватьМассив(Элементы.ПрочиеРасходы.ВыделенныеСтроки);
	Для Каждого Строка Из ВыделенныеСтроки Цикл
		ДанныеСтроки = Объект.ПрочиеРасходы.НайтиПоИдентификатору(Строка);
		ДанныеСтроки.СтатьяРасходовБУ = Результат;
		Элементы.ПрочиеРасходы.ТекущаяСтрока = Строка;
		ПрочиеРасходыСтатьяРасходовПриИзмененииСервер(КэшированныеЗначения);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура Док_УстановитьОбъектРасходовПосле(Команда)

	ВыделенныеСтроки = Элементы.ПрочиеРасходы.ВыделенныеСтроки;
	
	Если Объект.ПрочиеРасходы.Количество() = 0 ИЛИ НЕ ЗначениеЗаполнено(ВыделенныеСтроки) Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Для выполнения команды требуется выделить строки табличной части.'"));
		Возврат;
	КонецЕсли;
	
	СтруктураПараметры = Новый Структура;
	ВыбранноеЗначение = Неопределено;
	
	ОткрытьФорму(
		"Общаяформа.ФормаВыбораОбъектовАналитики", 
		СтруктураПараметры,
		ЭтаФорма,,,, Новый ОписаниеОповещения("УстановитьОбъектРасходовЗавершение", ЭтотОбъект, Новый Структура("ВыделенныеСтроки", ВыделенныеСтроки)), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры
	
&НаКлиенте
Процедура УстановитьОбъектРасходовЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    ВыделенныеСтроки = ДополнительныеПараметры.ВыделенныеСтроки;
    ВыбранноеЗначение = Результат;
    
    Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда    
        Для Каждого Строка Из ВыделенныеСтроки Цикл 
            СтрокаТаблицы = Объект.ПрочиеРасходы.НайтиПоИдентификатору(Строка);
            Если СтрокаТаблицы <> Неопределено Тогда
                СтрокаТаблицы.ОбъектРасходов = ВыбранноеЗначение.ОбъектРасходов;
                СтрокаТаблицы.АналитикаОбъекта = ВыбранноеЗначение.АналитикаОбъекта;
            КонецЕсли; 
        КонецЦикла; 
    КонецЕсли;

КонецПроцедуры
